# CannotPasteViewReferences Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures..::..CannotPasteViewReferences Property
BuiltInFailures..::..ViewFailures Class See Also
---
Cannot paste view references into the view they reference or into unrelated views
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteViewReferences { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteViewReferences As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteViewReferences {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewFailures Class
Autodesk.Revit.DB Namespace